Welcome to the little Python developer test
===================================

Below you will find few exercises to work on. For each exercise there is a cell to write your code in. Occasionally some code sniplet is provided to start with. Once you have filled a cell, you can run your code in the cells. If your code needs a variable which has been assigned in another cell above or it needs some package which is imported in another cell, then please make sure the pre-requisite cell has been run before the cell at hand. 

You can use any sources to solve the questions and the target time for the test is around 10 minutes. When you are done, please save the notebook as .ipynb and send it to me. If you had any question, contact me. Good coding!

Exercise 1
---------------
You will be provided with a pandas dataframe which contains the population and area of some American states. Please calculate the density of the states in a new column called 'density'.

In [1]:
import pandas as pd
area = pd.Series({'California': 423967, 'Texas': 695662,
                  'New York': 141297, 'Florida': 170312,
                  'Illinois': 149995})
pop = pd.Series({'California': 38332521, 'Texas': 26448193,
                 'New York': 19651127, 'Florida': 19552860,
                 'Illinois': 12882135})
data = pd.DataFrame({'area':area, 'pop':pop})
data

              area       pop
California  423967  38332521
Florida     170312  19552860
Illinois    149995  12882135
New York    141297  19651127
Texas       695662  26448193

In [2]:
data['density'] = data['pop'] / data['area']
data

              area       pop     density
California  423967  38332521   90.413926
Florida     170312  19552860  114.806121
Illinois    149995  12882135   85.883763
New York    141297  19651127  139.076746
Texas       695662  26448193   38.018740

Exercise 2
--------------
Select the 'area'column from the dataframe and assign it as a dataframe with the name 'state_area'.

In [3]:
state_area = data['area']
state_area

California    423967
Florida       170312
Illinois      149995
New York      141297
Texas         695662
Name: area, dtype: int64

Exercise 3
--------------
Select the rows of those states in 'data' where the density is higher than 100. Assign it to 'crowded' dataframe.

In [4]:
crowded = data.loc[data['density'] > 100, :]
crowded

            area       pop     density
Florida   170312  19552860  114.806121
New York  141297  19651127  139.076746

Exercise 4
--------------
Create a column in 'data' which has True value if the state name is longer than 7 characters otherwise False. Calculate the average density for the two groups of states.

In [5]:
data2 = data.reset_index()
data2['length_name'] = data2['index'].apply(lambda x: len(x))
data2['long_name'] = data2['length_name'] > 7
avg_density = data2.groupby(['long_name'])['density'].mean()
avg_density

long_name
False     76.412430
True     105.124812
Name: density, dtype: float64

Exercise 5
--------
You will have two dataframes which contains the name of employees, their groups and their salaries. Merge the two dataframes such that in each row we can see the group and the salary of an employee next to each other. Call the new dataframe 'employee'.

In [6]:
employee_group = pd.DataFrame({'employee': ['Bob', 'Jake', 'Lisa', 'Sue'],
                    'group': ['Accounting', 'Engineering', 'Engineering', 'HR']})
name_salary = pd.DataFrame({'name': ['Bob', 'Jake', 'Lisa', 'Sue'],
                    'salary': [70000, 80000, 120000, 90000]})
display(employee_group)
display(name_salary)

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR

   name  salary
0   Bob   70000
1  Jake   80000
2  Lisa  120000
3   Sue   90000

In [7]:
employee = employee_group.merge(name_salary, left_on='employee', right_on='name', how='outer')
employee = employee.drop(['name'], axis=1)
employee

  employee        group  salary
0      Bob   Accounting   70000
1     Jake  Engineering   80000
2     Lisa  Engineering  120000
3      Sue           HR   90000

Exercise 6
--------
Use groupby command on 'employee' such that the resulted dataframe shows the maximum salary in each 'group'.

In [8]:
employee.groupby('group')['salary'].max()

group
Accounting      70000
Engineering    120000
HR              90000
Name: salary, dtype: int64

Exercise 7
---------
Make a statistics from the Titanic survival data. Use pivot_table command to calculate survival ratio within groups where the dimensions are: gender and the travel class (labeled as 'sex' and 'class' in the data)

In [11]:
import numpy as np
import seaborn as sns
titanic = sns.load_dataset('titanic')

In [12]:
titanic.pivot_table('survived', index='sex', columns='class')

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447